Tekla Open API Reference for Tekla Structures 2025
BindableRadioButton.Checked Property
 Gets or sets a value indicating whether the control is checked.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Checked { get; set; }
Public Property Checked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BindableRadioButton Class
Tekla.Structures.Dialog.UIControls Namespace